# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn'
brew 'the_silver_searcher' # A faster and easier alternative to grep
brew 'tmux'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure

# Development
brew 'php'
brew 'php@7.4'
brew 'composer'
brew 'nvm'
brew 'yarn'

# Apps
cask 'alfred'
cask 'bartender'
cask 'caffeine'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'hazel'
cask 'insomnia'
cask 'iterm2'
cask 'kap'
cask 'phpstorm'
cask 'sequel-pro'
cask 'there'
cask 'tinkerwell'
cask 'visual-studio-code'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'

# Mac App Store
mas 'CloudApp', id: 417602904
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Spark', id: 1176895641
mas 'Things 3', id: 904280696
mas 'Toothfairy', id: 1191449274
mas 'Evernote', id: 406056744
mas '1Password 7 - Password Manager', id: 1333542190

