# Binaries
brew 'aider'
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts
brew 'the_silver_searcher' # A faster and easier alternative to grep
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'vips'

# Development
brew 'yarn'
brew 'nvm'

# Apps
cask 'alfred'
cask 'amethyst'
cask 'bartender'
cask 'caffeine'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'hazel'
cask 'httpie'
cask 'insomnia'
cask 'iterm2'
cask 'obsidian'
cask 'postman'
cask 'slack'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-menlo-for-powerline'

# Mac App Store
mas 'Drafts', id: 1435957248
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Toothfairy', id: 1191449274
mas 'WireGuard', id: 1451685025

# VS Code Extensions
vscode "vscodevim.vim"
